Tekla Open API Reference for Tekla Structures 2025
ComponentCatalog Properties
The ComponentCatalog type exposes the following members.
Properties
Name | Description
SelectedComponentType
 Gets or sets the selected component type in the control.
SelectedName
 Gets or sets the selected component name in the control.
SelectedNumber
 Gets or sets the selected component number in the control.
Top
See Also
Reference
ComponentCatalog Class
Tekla.Structures.Dialog.UIControls Namespace